tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf2585_tdd.h
#define LC2                           3881
#define LATC3                         3882
#define LC3                           3883
#define LATC4                         3884
#define LC4                           3885
#define LATC5                         3886
#define LC5                           3887
#define LATC6                         3888
#define LC6                           3889
#define LATC7                         3890
#define LC7                           3891
#define TRISA                         3892
#define TRISA0                        3893
#define TRISA_RA0                     3894
#define TRISA1                        3895
#define TRISA_RA1                     3896
#define TRISA2                        3897
#define TRISA_RA2                     3898
#define TRISA3                        3899
#define TRISA_RA3                     3900
#define TRISA_RA4                     3901
#define TRISA4                        3902
#define TRISA_RA5                     3903
#define TRISA5                        3904
#define TRISA_RA6                     3905
#define TRISA6                        3906
#define TRISA_RA7                     3907
#define TRISA7                        3908
#define TRISB                         3909
#define TRISB_RB0                     3910
#define TRISB0                        3911
#define TRISB_RB1                     3912
#define TRISB1                        3913
#define TRISB_RB2                     3914
#define TRISB2                        3915
#define TRISB_RB3                     3916
#define TRISB3                        3917
#define TRISB_RB4                     3918
#define TRISB4                        3919
#define TRISB_RB5                     3920
#define TRISB5                        3921
#define TRISB_RB6                     3922
#define TRISB6                        3923
#define TRISB_RB7                     3924
#define TRISB7                        3925
#define TRISC                         3926
#define TRISC0                        3927
#define TRISC_RC0                     3928
#define TRISC1                        3929
#define TRISC_RC1                     3930
#define TRISC2                        3931
#define TRISC_RC2                     3932
#define TRISC3                        3933
#define TRISC_RC3                     3934
#define TRISC4                        3935
#define TRISC_RC4                     3936
#define TRISC5                        3937
#define TRISC_RC5                     3938
#define TRISC6                        3939
#define TRISC_RC6                     3940
#define TRISC7                        3941
#define TRISC_RC7                     3942
#define OSCTUNE                       3943
#define TUN0                          3944
#define TUN                           3945
#define TUN1                          3946
#define TUN2                          3947
#define TUN3                          3948
#define TUN4                          3949
#define PLLEN                         3950
#define INTSCR                        3951
#define INTSRC                        3952
#define PIE1                          3953
#define TMR1IE                        3954
#define TMR2IE                        3955
#define CCP1IE                        3956
#define SSPIE                         3957
#define PIE1_TX1IE                    3958
#define TXIE                          3959
#define RCIE                          3960
#define RC1IE                         3961
#define ADIE                          3962
#define PIR1                          3963
#define TMR1IF                        3964
#define TMR2IF                        3965
#define CCP1IF                        3966
#define SSPIF                         3967
#define TXIF                          3968
#define PIR1_TX1IF                    3969
#define RCIF                          3970
#define RC1IF                         3971
#define ADIF                          3972
#define IPR1                          3973
#define TMR1IP                        3974
#define TMR2IP                        3975
#define CCP1IP                        3976
#define SSPIP                         3977
#define TXBIP                         3978
#define TX1IP                         3979
#define TXIP                          3980
#define RCIP                          3981
#define RC1IP                         3982
#define ADIP                          3983
#define PIE2                          3984
#define TMR3IE                        3985
#define HLVDIE                        3986
#define LVDIE                         3987
#define BCLIE                         3988
#define EEIE                          3989
#define OSCFIE                        3990
#define PIR2                          3991
#define TMR3IF                        3992
#define HLVDIF                        3993
#define LVDIF                         3994
#define BCLIF                         3995
#define EEIF                          3996
#define OSCFIF                        3997
#define IPR2                          3998
#define TMR3IP                        3999
#define HLVDIP                        4000
#define LVDIP                         4001
#define BCLIP                         4002
#define EEIP                          4003
#define OSCFIP                        4004
#define PIE3                          4005
#define FIFOMWIE                      4006
#define FIFOWMIE                      4007
#define PIE3_RXB0IE                   4008
#define RXBnIE                        4009
#define RXBNIE                        4010
#define PIE3_RXB1IE                   4011
#define PIE3_TXB0IE                   4012
#define PIE3_TXB1IE                   4013
#define TXBnIE                        4014
#define PIE3_TXB2IE                   4015
#define TXBNIE                        4016
#define ERRIE                         4017
#define WAKIE                         4018
#define IRXIE                         4019
#define PIR3                          4020
#define FIFOWMIF                      4021
#define RXB0IF                        4022
#define RXBnIF                        4023
#define RXBNIF                        4024
#define RXB1IF                        4025
#define TXB0IF                        4026
#define TXB1IF                        4027
#define TXB2IF                        4028
#define TXBNIF                        4029
#define TXBnIF                        4030
#define ERRIF                         4031
#define WAKIF                         4032
#define IRXIF                         4033
#define IPR3                          4034
#define RXB0IP                        4035
#define FIFOWMIP                      4036
#define RXB1IP                        4037
#define RXBNIP                        4038
#define RXBnIP                        4039
#define TXB0IP                        4040
#define TXB1IP                        4041
#define TXBNIP                        4042
#define TXBnIP                        4043
#define TXB2IP                        4044
#define ERRIP                         4045
#define WAKIP                         4046
#define IRXIP                         4047
#define EECON1                        4048
#define RD                            4049
#define WR                            4050
#define WREN                          4051
#define WRERR                         4052
#define FREE                          4053
#define CFGS                          4054
#define EEFS                          4055
#define EEPGD                         4056
#define RCSTA                         4057
#define RCD8                          4058
#define RX9D                          4059
#define OERR                          4060
#define FERR                          4061
#define ADDEN                         4062
#define ADEN                          4063
#define CREN                          4064
#define SRENA                         4065
#define SREN                          4066
#define RC9                           4067
#define RC8_9                         4068
#define RX9                           4069
#define SPEN                          4070
#define TXSTA                         4071
#define TXD8                          4072
#define TX9D1                         4073
#define TX9D                          4074
#define TRMT                          4075
#define TRMT1                         4076
#define BRGH1                         4077
#define BRGH                          4078
#define SENDB1                        4079
#define SENDB                         4080
#define SYNC                          4081
#define SYNC1                         4082
#define TXEN1                         4083
#define TXEN                          4084
#define TX91                          4085
#define TX8_9                         4086
#define TX9                           4087
#define CSRC1                         4088
#define CSRC                          4089
#define T3CON                         4090
#define TMR3ON                        4091
#define TMR3CS                        4092
#define nT3SYNC                       4093
#define T3NSYNC                       4094
#define NOT_T3SYNC                    4095
#define T3SYNC                        4096
#define SOSCEN3                       4097
#define T3CCP1                        4098
#define T3CKPS                        4099
#define T3CKPS0                       4100
#define T3CKPS1                       4101
#define T3ECCP1                       4102
#define T3CCP2                        4103
#define T3CON_RD16                    4104
#define RD163                         4105
#define T3RD16                        4106
#define BAUDCON                       4107
#define ABDEN                         4108
#define W4E                           4109
#define WUE                           4110
#define BRG16                         4111
#define TXCKP                         4112
#define SCKP                          4113
#define RXCKP                         4114
#define RXDTP                         4115
#define RCIDL                         4116
#define ABDOVF                        4117
#define CCP1CON                       4118
#define CCP1M0                        4119
#define CCP1M                         4120
#define CCP1M1                        4121
#define CCP1M2                        4122
#define CCP1M3                        4123
#define DC1B                          4124
#define DC1B0                         4125
#define DC1B1                         4126
#define ADCON2                        4127
#define ADCS0                         4128
#define ADCS                          4129
#define ADCS1                         4130
#define ADCS2                         4131
#define ACQT0                         4132
#define ACQT                          4133
#define ACQT1                         4134
#define ACQT2                         4135
#define ADFM                          4136
#define ADCON1                        4137
#define PCFG0                         4138
#define PCFG                          4139
#define PCFG1                         4140
#define PCFG2                         4141
#define CHSN3                         4142
#define PCFG3                         4143
#define VCFG                          4144
#define VCFG0                         4145
#define VCFG01                        4146
#define VCFG11                        4147
#define VCFG1                         4148
#define ADCON0                        4149
#define ADON                          4150
#define nDONE                         4151
#define GO_nDONE                      4152
#define NOT_DONE                      4153
#define GODONE                        4154
#define GO_DONE                       4155
#define DONE                          4156
#define GO_NOT_DONE                   4157
#define GO                            4158
#define CHS0                          4159
#define CHS                           4160
#define CHS1                          4161
#define CHS2                          4162
#define CHS3                          4163
#define SSPCON2                       4164
#define SEN                           4165
#define RSEN                          4166
#define PEN                           4167
#define RCEN                          4168
#define ACKEN                         4169
#define ACKDT                         4170
#define ACKSTAT                       4171
#define GCEN                          4172
#define SSPCON1                       4173
#define SSPM0                         4174
#define SSPM                          4175
#define SSPM1                         4176
#define SSPM2                         4177
#define SSPM3                         4178
#define CKP                           4179
#define SSPEN                         4180
#define SSPOV                         4181
#define WCOL                          4182
#define SSPSTAT                       4183
#define BF                            4184
#define UA                            4185
#define R_NOT_W                       4186
#define READ_WRITE                    4187
#define NOT_W                         4188
#define R_W                           4189
#define nW                            4190
#define RW                            4191
#define nWRITE                        4192
#define R                             4193
#define NOT_WRITE                     4194
#define R_nW                          4195
#define I2C_READ                      4196
#define START                         4197
#define S                             4198
#define I2C_START                     4199
#define STOP                          4200
#define I2C_STOP                      4201
#define P                             4202
#define NOT_A                         4203
#define DATA_ADDRESS                  4204
#define nA                            4205
#define D_A                           4206
#define D_nA                          4207
#define D                             4208
#define DA                            4209
#define D_NOT_A                       4210
#define NOT_ADDRESS                   4211
#define nADDRESS                      4212
#define I2C_DAT                       4213
#define CKE                           4214
#define SMP                           4215
#define T2CON                         4216
#define T2CKPS0                       4217
#define T2CKPS                        4218
#define T2CKPS1                       4219
#define TMR2ON                        4220
#define T2OUTPS0                      4221
#define T2OUTPS                       4222
#define TOUTPS0                       4223
#define TOUTPS                        4224
#define T2OUTPS1                      4225
#define TOUTPS1                       4226
#define T2OUTPS2                      4227
#define TOUTPS2                       4228
#define T2OUTPS3                      4229
#define TOUTPS3                       4230
#define PR2                           4231
#define WM0                           4232
#define WM1                           4233
#define WAIT0                         4234
#define WAIT1                         4235
#define EBDIS                         4236
#define T1CON                         4237
#define TMR1ON                        4238
#define TMR1CS                        4239
#define NOT_T1SYNC                    4240
#define T1SYNC                        4241
#define nT1SYNC                       4242
#define T1INSYNC                      4243
#define T1OSCEN                       4244
#define SOSCEN                        4245
#define T1CKPS0                       4246
#define T1CKPS                        4247
#define T1CKPS1                       4248
#define T1RUN                         4249
#define T1RD16                        4250
#define T1CON_RD16                    4251
#define RCON                          4252
#define BOR                           4253
#define NOT_BOR                       4254
#define nBOR                          4255
#define POR                           4256
#define nPOR                          4257
#define NOT_POR                       4258
#define PD                            4259
#define nPD                           4260
#define NOT_PD                        4261
#define NOT_TO                        4262
#define nTO                           4263
#define TO                            4264
#define nRI                           4265
#define NOT_RI                        4266
#define RI                            4267
#define SBOREN                        4268
#define IPEN                          4269
#define WDTCON                        4270
#define SWDTE                         4271
#define SWDTEN                        4272
#define HLVDCON                       4273
#define HLVDL                         4274
#define HLVDL0                        4275
#define LVV0                          4276
#define LVDL0                         4277
#define HLVDL1                        4278
#define LVDL1                         4279
#define LVV1                          4280
#define HLVDL2                        4281
#define LVV2                          4282
#define LVDL2                         4283
#define HLVDL3                        4284
#define LVV3                          4285
#define LVDL3                         4286
#define HLVDEN                        4287
#define LVDEN                         4288
#define BGST                          4289
#define IRVST                         4290
#define IVRST                         4291
#define VDIRMAG                       4292
#define OSCCON                        4293
#define SCS0                          4294
#define SCS                           4295
#define SCS1                          4296
#define IOFS                          4297
#define OSTS                          4298
#define IRCF                          4299
#define IRCF0                         4300
#define IRCF1                         4301
#define IRCF2                         4302
#define IDLEN                         4303
#define T0CON                         4304
#define T0PS                          4305
#define T0PS0                         4306
#define T0PS1                         4307
#define T0PS2                         4308
#define PSA                           4309
#define T0PS3                         4310
#define T0SE                          4311
#define T0CS                          4312
#define T08BIT                        4313
#define TMR0ON                        4314
#define STATUS                        4315
#define C                             4316
#define CARRY                         4317
#define DC                            4318
#define ZERO                          4319
#define Z                             4320
#define OV                            4321
#define OVERFLOW                      4322
#define N                             4323
#define NEGATIVE                      4324
#define INTCON3                       4325
#define INT1IF                        4326
#define INT1F                         4327
#define INT2IF                        4328
#define INT2F                         4329
#define INT1E                         4330
#define INT1IE                        4331
#define INT2IE                        4332
#define INT2E                         4333
#define INT1P                         4334
#define INT1IP                        4335
#define INT2IP                        4336
#define INT2P                         4337
#define INTCON2                       4338
#define RBIP                          4339
#define TMR0IP                        4340
#define T0IP                          4341
#define INTEDG2                       4342
#define INTEDG1                       4343
#define INTEDG0                       4344
#define RBPU                          4345
#define NOT_RBPU                      4346
#define nRBPU                         4347
#define INTCON                        4348
#define RBIF                          4349
#define INT0F                         4350
#define INT0IF                        4351
#define T0IF                          4352
#define TMR0IF                        4353
#define RBIE                          4354
#define INT0E                         4355
#define INT0IE                        4356
#define T0IE                          4357
#define TMR0IE                        4358
#define PEIE                          4359
#define PEIE_GIEL                     4360
#define GIEL                          4361
#define GIE_GIEH                      4362
#define GIE                           4363
#define GIEH                          4364
#define STKPTR0                       4365
#define STKPTR                        4366
#define STKPTR1                       4367
#define STKPTR2                       4368
#define STKPTR3                       4369
#define STKPTR4                       4370
#define STKUNF                        4371
#define STKOVF                        4372
#define STKFUL                        4373

#endif // _PIC18LF2585_H_
